common/models/UserWorkshops.php

	public function checkUniqueness($attribute,$params): void
	{
		$model = self::find()->where(['workshops_id'=>$this->workshops_id])->andWhere(['user_id'=>$this->user_ids])
			->all();
---
SELECT * FROM `user_workshops` WHERE (`workshops_id`='1') AND (`user_id` IN ('1', '3'))