frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        return $user->save() && $this->sendEmail($user);
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('admin', 'asdmin@asd.com', '$2y$13$/cpqD4n5yNgpOqSQrQtLb.SsExrjRRtimSZEcKGIZ6LK08/pOa2wO', '_Wu_-qKcluRd66sqFRqmxBxRJazVcIr9', 'rRZ3oMmKzfclEHJ_feeIw4VhsoQTTkse_1619210862', 9, 1619210862, 1619210862)