backend/components/EmailService.php

	public function sendSubscribed(AppendUserEvent $event): void
	{
		$mails = ["mailList" => $event->userList];
		Yii::$app->queue->push(new SendEmail($mails));
---
INSERT INTO `queue` (`channel`, `job`, `pushed_at`, `ttr`, `delay`, `priority`) VALUES ('default', 'O:22:\"console\\jobs\\SendEmail\":1:{s:8:\"mailList\";a:2:{s:12:\"workshops_id\";s:1:\"1\";s:8:\"user_ids\";a:2:{i:0;s:1:\"1\";i:1;s:1:\"3\";}}}', 1619309665, 300, 0, 1024)